Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk0256gpg048.h
#define _SDI1R_SDI1R_POSITION                    0x00000000
#define _SDI1R_SDI1R_MASK                        0x0000000F
#define _SDI1R_SDI1R_LENGTH                      0x00000004

#define _SS1R_SS1R_POSITION                      0x00000000
#define _SS1R_SS1R_MASK                          0x0000000F
#define _SS1R_SS1R_LENGTH                        0x00000004

#define _SCK2R_SCK2R_POSITION                    0x00000000
#define _SCK2R_SCK2R_MASK                        0x0000000F
#define _SCK2R_SCK2R_LENGTH                      0x00000004

#define _SDI2R_SDI2R_POSITION                    0x00000000
#define _SDI2R_SDI2R_MASK                        0x0000000F
#define _SDI2R_SDI2R_LENGTH                      0x00000004

#define _SS2R_SS2R_POSITION                      0x00000000
#define _SS2R_SS2R_MASK                          0x0000000F
#define _SS2R_SS2R_LENGTH                        0x00000004

#define _SCK3R_SCK3R_POSITION                    0x00000000
#define _SCK3R_SCK3R_MASK                        0x0000000F
#define _SCK3R_SCK3R_LENGTH                      0x00000004

#define _SDI3R_SDI3R_POSITION                    0x00000000
#define _SDI3R_SDI3R_MASK                        0x0000000F
#define _SDI3R_SDI3R_LENGTH                      0x00000004

#define _SS3R_SS3R_POSITION                      0x00000000
#define _SS3R_SS3R_MASK                          0x0000000F
#define _SS3R_SS3R_LENGTH                        0x00000004

#define _SCK4R_SCK4R_POSITION                    0x00000000
#define _SCK4R_SCK4R_MASK                        0x0000000F
#define _SCK4R_SCK4R_LENGTH                      0x00000004

#define _SDI4R_SDI4R_POSITION                    0x00000000
#define _SDI4R_SDI4R_MASK                        0x0000000F
#define _SDI4R_SDI4R_LENGTH                      0x00000004

#define _SS4R_SS4R_POSITION                      0x00000000
#define _SS4R_SS4R_MASK                          0x0000000F
#define _SS4R_SS4R_LENGTH                        0x00000004

#define _C1RXR_C1RXR_POSITION                    0x00000000
#define _C1RXR_C1RXR_MASK                        0x0000000F
#define _C1RXR_C1RXR_LENGTH                      0x00000004

#define _C2RXR_C2RXR_POSITION                    0x00000000
#define _C2RXR_C2RXR_MASK                        0x0000000F
#define _C2RXR_C2RXR_LENGTH                      0x00000004

#define _REFIR_REFIR_POSITION                    0x00000000
#define _REFIR_REFIR_MASK                        0x0000000F
#define _REFIR_REFIR_LENGTH                      0x00000004

#define _QEA1R_QEA1R_POSITION                    0x00000000
#define _QEA1R_QEA1R_MASK                        0x0000000F
#define _QEA1R_QEA1R_LENGTH                      0x00000004

#define _QEB1R_QEB1R_POSITION                    0x00000000
#define _QEB1R_QEB1R_MASK                        0x0000000F
#define _QEB1R_QEB1R_LENGTH                      0x00000004

#define _INDX1R_INDX1R_POSITION                  0x00000000
#define _INDX1R_INDX1R_MASK                      0x0000000F
#define _INDX1R_INDX1R_LENGTH                    0x00000004

#define _HOME1R_HOME1R_POSITION                  0x00000000
#define _HOME1R_HOME1R_MASK                      0x0000000F
#define _HOME1R_HOME1R_LENGTH                    0x00000004

#define _QEA2R_QEA2R_POSITION                    0x00000000
#define _QEA2R_QEA2R_MASK                        0x0000000F
#define _QEA2R_QEA2R_LENGTH                      0x00000004

#define _QEB2R_QEB2R_POSITION                    0x00000000
#define _QEB2R_QEB2R_MASK                        0x0000000F
#define _QEB2R_QEB2R_LENGTH                      0x00000004

#define _INDX2R_INDX2R_POSITION                  0x00000000
#define _INDX2R_INDX2R_MASK                      0x0000000F
#define _INDX2R_INDX2R_LENGTH                    0x00000004

#define _HOME2R_HOME2R_POSITION                  0x00000000
#define _HOME2R_HOME2R_MASK                      0x0000000F
#define _HOME2R_HOME2R_LENGTH                    0x00000004

#define _FLT1R_FLT1R_POSITION                    0x00000000
#define _FLT1R_FLT1R_MASK                        0x0000000F
#define _FLT1R_FLT1R_LENGTH                      0x00000004

#define _FLT2R_FLT2R_POSITION                    0x00000000
#define _FLT2R_FLT2R_MASK                        0x0000000F
#define _FLT2R_FLT2R_LENGTH                      0x00000004

#define _IC10R_IC10R_POSITION                    0x00000000
#define _IC10R_IC10R_MASK                        0x0000000F
#define _IC10R_IC10R_LENGTH                      0x00000004

#define _IC11R_IC11R_POSITION                    0x00000000
#define _IC11R_IC11R_MASK                        0x0000000F
#define _IC11R_IC11R_LENGTH                      0x00000004

#define _IC12R_IC12R_POSITION                    0x00000000
#define _IC12R_IC12R_MASK                        0x0000000F
#define _IC12R_IC12R_LENGTH                      0x00000004

#define _IC13R_IC13R_POSITION                    0x00000000
#define _IC13R_IC13R_MASK                        0x0000000F
#define _IC13R_IC13R_LENGTH                      0x00000004

#define _IC14R_IC14R_POSITION                    0x00000000
#define _IC14R_IC14R_MASK                        0x0000000F
#define _IC14R_IC14R_LENGTH                      0x00000004

#define _IC15R_IC15R_POSITION                    0x00000000
#define _IC15R_IC15R_MASK                        0x0000000F
#define _IC15R_IC15R_LENGTH                      0x00000004

#define _IC16R_IC16R_POSITION                    0x00000000
#define _IC16R_IC16R_MASK                        0x0000000F
#define _IC16R_IC16R_LENGTH                      0x00000004

#define _SCK5R_SCK5R_POSITION                    0x00000000
#define _SCK5R_SCK5R_MASK                        0x0000000F
#define _SCK5R_SCK5R_LENGTH                      0x00000004

#define _SDI5R_SDI5R_POSITION                    0x00000000
#define _SDI5R_SDI5R_MASK                        0x0000000F
#define _SDI5R_SDI5R_LENGTH                      0x00000004

#define _SS5R_SS5R_POSITION                      0x00000000
#define _SS5R_SS5R_MASK                          0x0000000F
#define _SS5R_SS5R_LENGTH                        0x00000004

