Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk0256gpg048.h
#define _CLC4GLS_G2D4N_POSITION                  0x0000000E
#define _CLC4GLS_G2D4N_MASK                      0x00004000
#define _CLC4GLS_G2D4N_LENGTH                    0x00000001

#define _CLC4GLS_G2D4T_POSITION                  0x0000000F
#define _CLC4GLS_G2D4T_MASK                      0x00008000
#define _CLC4GLS_G2D4T_LENGTH                    0x00000001

#define _CLC4GLS_G3D1N_POSITION                  0x00000010
#define _CLC4GLS_G3D1N_MASK                      0x00010000
#define _CLC4GLS_G3D1N_LENGTH                    0x00000001

#define _CLC4GLS_G3D1T_POSITION                  0x00000011
#define _CLC4GLS_G3D1T_MASK                      0x00020000
#define _CLC4GLS_G3D1T_LENGTH                    0x00000001

#define _CLC4GLS_G3D2N_POSITION                  0x00000012
#define _CLC4GLS_G3D2N_MASK                      0x00040000
#define _CLC4GLS_G3D2N_LENGTH                    0x00000001

#define _CLC4GLS_G3D2T_POSITION                  0x00000013
#define _CLC4GLS_G3D2T_MASK                      0x00080000
#define _CLC4GLS_G3D2T_LENGTH                    0x00000001

#define _CLC4GLS_G3D3N_POSITION                  0x00000014
#define _CLC4GLS_G3D3N_MASK                      0x00100000
#define _CLC4GLS_G3D3N_LENGTH                    0x00000001

#define _CLC4GLS_G3D3T_POSITION                  0x00000015
#define _CLC4GLS_G3D3T_MASK                      0x00200000
#define _CLC4GLS_G3D3T_LENGTH                    0x00000001

#define _CLC4GLS_G3D4N_POSITION                  0x00000016
#define _CLC4GLS_G3D4N_MASK                      0x00400000
#define _CLC4GLS_G3D4N_LENGTH                    0x00000001

#define _CLC4GLS_G3D4T_POSITION                  0x00000017
#define _CLC4GLS_G3D4T_MASK                      0x00800000
#define _CLC4GLS_G3D4T_LENGTH                    0x00000001

#define _CLC4GLS_G4D1N_POSITION                  0x00000018
#define _CLC4GLS_G4D1N_MASK                      0x01000000
#define _CLC4GLS_G4D1N_LENGTH                    0x00000001

#define _CLC4GLS_G4D1T_POSITION                  0x00000019
#define _CLC4GLS_G4D1T_MASK                      0x02000000
#define _CLC4GLS_G4D1T_LENGTH                    0x00000001

#define _CLC4GLS_G4D2N_POSITION                  0x0000001A
#define _CLC4GLS_G4D2N_MASK                      0x04000000
#define _CLC4GLS_G4D2N_LENGTH                    0x00000001

#define _CLC4GLS_G4D2T_POSITION                  0x0000001B
#define _CLC4GLS_G4D2T_MASK                      0x08000000
#define _CLC4GLS_G4D2T_LENGTH                    0x00000001

#define _CLC4GLS_G4D3N_POSITION                  0x0000001C
#define _CLC4GLS_G4D3N_MASK                      0x10000000
#define _CLC4GLS_G4D3N_LENGTH                    0x00000001

#define _CLC4GLS_G4D3T_POSITION                  0x0000001D
#define _CLC4GLS_G4D3T_MASK                      0x20000000
#define _CLC4GLS_G4D3T_LENGTH                    0x00000001

#define _CLC4GLS_G4D4N_POSITION                  0x0000001E
#define _CLC4GLS_G4D4N_MASK                      0x40000000
#define _CLC4GLS_G4D4N_LENGTH                    0x00000001

#define _CLC4GLS_G4D4T_POSITION                  0x0000001F
#define _CLC4GLS_G4D4T_MASK                      0x80000000
#define _CLC4GLS_G4D4T_LENGTH                    0x00000001

#define _ANSELA_ANSA0_POSITION                   0x00000000
#define _ANSELA_ANSA0_MASK                       0x00000001
#define _ANSELA_ANSA0_LENGTH                     0x00000001

#define _ANSELA_ANSA1_POSITION                   0x00000001
#define _ANSELA_ANSA1_MASK                       0x00000002
#define _ANSELA_ANSA1_LENGTH                     0x00000001

#define _ANSELA_ANSA4_POSITION                   0x00000004
#define _ANSELA_ANSA4_MASK                       0x00000010
#define _ANSELA_ANSA4_LENGTH                     0x00000001

#define _ANSELA_ANSA8_POSITION                   0x00000008
#define _ANSELA_ANSA8_MASK                       0x00000100
#define _ANSELA_ANSA8_LENGTH                     0x00000001

#define _ANSELA_ANSA11_POSITION                  0x0000000B
#define _ANSELA_ANSA11_MASK                      0x00000800
#define _ANSELA_ANSA11_LENGTH                    0x00000001

#define _ANSELA_ANSA12_POSITION                  0x0000000C
#define _ANSELA_ANSA12_MASK                      0x00001000
#define _ANSELA_ANSA12_LENGTH                    0x00000001

#define _ANSELA_ANSA14_POSITION                  0x0000000E
#define _ANSELA_ANSA14_MASK                      0x00004000
#define _ANSELA_ANSA14_LENGTH                    0x00000001

#define _ANSELA_ANSA15_POSITION                  0x0000000F
#define _ANSELA_ANSA15_MASK                      0x00008000
#define _ANSELA_ANSA15_LENGTH                    0x00000001

#define _ANSELA_w_POSITION                       0x00000000
#define _ANSELA_w_MASK                           0xFFFFFFFF
#define _ANSELA_w_LENGTH                         0x00000020

#define _TRISA_TRISA0_POSITION                   0x00000000
#define _TRISA_TRISA0_MASK                       0x00000001
#define _TRISA_TRISA0_LENGTH                     0x00000001

#define _TRISA_TRISA1_POSITION                   0x00000001
#define _TRISA_TRISA1_MASK                       0x00000002
#define _TRISA_TRISA1_LENGTH                     0x00000001

#define _TRISA_TRISA4_POSITION                   0x00000004
#define _TRISA_TRISA4_MASK                       0x00000010
#define _TRISA_TRISA4_LENGTH                     0x00000001

#define _TRISA_TRISA7_POSITION                   0x00000007
#define _TRISA_TRISA7_MASK                       0x00000080
#define _TRISA_TRISA7_LENGTH                     0x00000001

#define _TRISA_TRISA8_POSITION                   0x00000008
#define _TRISA_TRISA8_MASK                       0x00000100
#define _TRISA_TRISA8_LENGTH                     0x00000001

#define _TRISA_TRISA10_POSITION                  0x0000000A
#define _TRISA_TRISA10_MASK                      0x00000400
#define _TRISA_TRISA10_LENGTH                    0x00000001

#define _TRISA_TRISA11_POSITION                  0x0000000B
#define _TRISA_TRISA11_MASK                      0x00000800
#define _TRISA_TRISA11_LENGTH                    0x00000001

#define _TRISA_TRISA12_POSITION                  0x0000000C
#define _TRISA_TRISA12_MASK                      0x00001000
#define _TRISA_TRISA12_LENGTH                    0x00000001

#define _TRISA_TRISA14_POSITION                  0x0000000E
#define _TRISA_TRISA14_MASK                      0x00004000
#define _TRISA_TRISA14_LENGTH                    0x00000001

#define _TRISA_TRISA15_POSITION                  0x0000000F
#define _TRISA_TRISA15_MASK                      0x00008000
#define _TRISA_TRISA15_LENGTH                    0x00000001

